links.html
<!DOCTYPE html><html lang="en"><head><meta charset="utf-8"/><meta name="viewport" content="width=device-width, initial-scale=1.0"/><meta name="author" content="Reinhard Stahn"/><title>Links</title><link rel="icon" type="image/x-icon" sizes="any" href="./favicon/favicon.ico"/><!-- https://simplecss.org - License: MIT - We are using ./simple.css from commit dcb3545f2304356985c99acce9471ba3f559976b from https://github.com/kevquirk/simple.css --><link rel="stylesheet" href="./css/simple.css"/><link rel="stylesheet" href="./css/style.css"/></head><body><nav><a href="index.html">HOME</a></nav><h1 class="title">Links</h1>
<div id="outline-container-org14ea89e" class="outline-2">
<h2 id="org14ea89e">Other Collections of Solutions</h2>
<div class="outline-text-2" id="text-org14ea89e">
<p>
There are <i>alot</i> of solutions out there (mostly as pdf on Github or as answers on
StackExchange). I do not try to list them all but only the most interesting ones (based on
my personal opinion).
</p>

<p>
A word of warning: Take any solutions with a grain of salt (applies to my site
too). Sometimes, after I solved a <i>challenging</i> exercise I try to google it to find out
how others approach the problem. For each of these exercises the percentage of <i>just
wrong</i> solutions was very high. Sometimes I couldn't find any correct solution. Even
worse, some solutions gave the impression that the exercise is no big deal and the
solution is straightforward (which might be true but at least their solution did not
justify this).
</p>

<ul class="org-ul">
<li><a href="https://quantumcomputing.stackexchange.com/questions/tagged/nielsen-and-chuang">stackexchange</a>: You probably already knew this, just in case &#x2026;</li>
<li><a href="https://github.com/jacobwatkins1/Nielsen-and-Chuang-Solutions">jacobwatkins1</a>: Good quality, every chapter is touched, some are complete.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf3754b6" class="outline-2">
<h2 id="orgf3754b6">Misc</h2>
<div class="outline-text-2" id="text-orgf3754b6">
<ul class="org-ul">
<li><a href="https://www.michaelnielsen.org/qcqi/errata/errata/errata.html">Errata</a>: Seems to be not updated anymore and misses <i>a lot</i> of errors which are still in
the book. Yes, the book is great but I think it contains more errors than the typical
(good) math book (and yes it is a <i>math</i> book 😉).</li>
<li><a href="https://quantum.country/">quantum country</a>: So far I had no time to look into it but the website looks awesome.</li>
</ul>
</div>
</div>
<footer class="footer"><p>Made by <a href="https://github.com/rainij">Reinhard Stahn</a> with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1.90 (<a href="https://orgmode.org">Org</a> mode 9.6.11)</p><p>Find the source code on <a href="https://github.com/rainij/solutions-qcqi-nielsen-chuang">Github</a></p></footer></body></html>
